[
	{
		"Name": "A O\n",
		"link": "https://onepiece.fandom.com/wiki/A_O",
		"Year": "2009\n",
		"Note": "His name was revealed in the Green databook.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/8/8c/A_O_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20230528152214",
		"description": "A O[4] is an infamous New World pirate and captain of the A O Pirates.[2] He and his crew were subordinates to Whitebeard.[1]\n",
		"appareance": "A O is a very tall man with a long, square shaped face, hollow eyes under prominent eyebrows, dark sideburns that go all the way down to his chin, and greenish long wavy hair. On his head, he wears a yellow and brown striped bandanna and over it is a tricorn captain's hat with what appears to be his Jolly Roger on it, a white skull wearing an animal-like hood. He also wears a dark blue, open shirt with the sleeves rolled up and a ruffled collar, and elaborate earrings made up by three little jewels each on both ears.[1]\n"
	},
	{
		"Name": "Abdullah\n",
		"link": "https://onepiece.fandom.com/wiki/Abdullah",
		"Year": "2013\n",
		"Note": "\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/f/f1/Abdullah_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20151004140309",
		"description": "Abdullah[5] is a criminal and a former bounty hunter who joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi, along with his partner Jeet.[1] He is an ally of Luffy during the Dressrosa Arc. After the battle with the Donquixote Pirates at Dressrosa, he joined the XXX Gym Martial Arts Alliance, which later converted to a pirate crew called the Ideo Pirates.[2][3]\n",
		"appareance": "Abdullah has a pointed head that is bald on the top with black hair in pigtails hanging down the sides. His high forehead has three vertical scars on it. He sports thin rectangular sunglasses and along with large purple trousers held up by brown suspenders. He also has armor over his left arm.[1]\n"
	},
	{
		"Name": "Absalom\n",
		"link": "https://onepiece.fandom.com/wiki/Absalom",
		"Year": "2007\n",
		"Note": "\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/5/56/Absalom_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20230101154942",
		"description": "Absalom of the Graveyard was the commander of the Soldier Zombies and General Zombies of Thriller Bark prior to its collapse.[4] He was one of the Mysterious Four[2] of the Thriller Bark Pirates and one of the major antagonists of the Thriller Bark Saga.\n",
		"appareance": "Sometime during the timeskip, he became a reporter under the alias Absa.[3] At some point, he was abducted by the Blackbeard Pirates and killed to poach his Devil Fruit powers, with his ability going to Shiryu.[8]\n"
	},
	{
		"Name": "Acilia\n",
		"link": "https://onepiece.fandom.com/wiki/Acilia",
		"Year": "2013\n",
		"Note": "\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/0/0c/Acilia_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20180527001719",
		"description": "Acilia[2] is a gladiator at the Corrida Colosseum who participated in a tournament for the Mera Mera no Mi.[1]\n",
		"appareance": "Acilia's concept art from the anime."
	},
	{
		"Name": "Adele\n",
		"link": "https://onepiece.fandom.com/wiki/Adele",
		"Year": "2010\n",
		"Note": "Her name was revealed in the Blue Deep databook.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/d/dd/Adele_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20130210042308",
		"description": "Adele[4] is a spotted knifejaw mermaid[5] and an employee at the Mermaid Café.[2]\n",
		"appareance": "Adele in the Digitally Colored Manga."
	},
	{
		"Name": "Aegir\n",
		"link": "https://onepiece.fandom.com/wiki/Aegir",
		"Year": "2024\n",
		"Note": "His name was revealed in Chapter 1142.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/a/ac/Aegir_Manga_Infobox.png/revision/latest/scale-to-width-down/268?cb=20250309151156",
		"description": "Aegir is a student at the Walrus School on Elbaph.[1]\n",
		"appareance": "Aegir is an average-sized giant child with round eyes and nose, a large forehead, and short light hair which is spiked up. He wears a light long-sleeved shirt, a dark cape, a shoulder belt, a kilt, and boots.\n"
	},
	{
		"Name": "Ageha Woman\n",
		"link": "https://onepiece.fandom.com/wiki/Ageha_Woman",
		"Year": "2019\n",
		"Note": "Her name was revealed in the Vivre Card databook.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/6/6b/Ageha_Woman_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20240905004246",
		"description": "Ageha Woman[2] is a Gifter in the Beasts Pirates.[1]\n",
		"appareance": "Ageha Woman is a woman of average size, with long shoulder length purple hair. Due to the SMILE that she consumed, she possesses a pair set of large three butterfly wings from her upper back, antennae on her head, and a yellow scarf of some sort around her neck. Unlike other Gifters, she does not possess a pair of horns. She wears a pink flower-spotted leotard, with white gloves and red boots.[1]\n"
	},
	{
		"Name": "Aggie 68\n",
		"link": "https://onepiece.fandom.com/wiki/Aggie_68",
		"Year": "2009\n",
		"Note": "His name was revealed in One Piece Magazine Vol.2.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/e/e9/Aggie_68_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20171114122121",
		"description": "Aggie 68[2] is a member of the Spade Pirates.[1]\n",
		"appareance": "Aggie 68 is a large man with short hair and thick sideburns. His left arm is either covered or replaced by a three barrel gun.[1]\n"
	},
	{
		"Name": "Agotogi\n",
		"link": "https://onepiece.fandom.com/wiki/Agotogi",
		"Year": "2001\n",
		"Note": "His name was revealed in the Blue databook.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/8/8b/Agotogi_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20240812220755",
		"description": "Agotogi[2] was the leader of a gang of bandits who tried to kidnap Vivi about 11 years before the princess's return to Arabasta.[1]\n",
		"appareance": "Agotogi is a tan-skinned man of average height who has red spiky hair, a hooked nose, a wide smile, thin eyebrows, and a pointed chin. He wears an open-up green kimono with a few purple dots on it. He wears brown pants with a yellow sash to hold it up. He also wears typical sandals. It is also notable that he was always seen smiling until he was defeated.[1]\n"
	},
	{
		"Name": "Agsilly\n",
		"link": "https://onepiece.fandom.com/wiki/Agsilly",
		"Year": "2010\n",
		"Note": "His name was revealed in the Green databook.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/e/e8/Agsilly_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20130810194016",
		"description": "Agsilly[3] is a New World pirate who allied himself with the Whitebeard Pirates.[2]\n",
		"appareance": "A sketch of Agsilly."
	},
	{
		"Name": "Agyo\n",
		"link": "https://onepiece.fandom.com/wiki/Agyo",
		"Year": "2013\n",
		"Note": "His name was revealed in Chapter 733.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/1/11/Agyo_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20140707173009",
		"description": "Agyo[3] is a fighting lion (闘獅子, Tōjishi?) and a gladiator competing at the Corrida Colosseum for the Mera Mera no Mi.[1]\n",
		"appareance": "Agyo appears to be a white lion with whiskers, sharp teeth and a mane. He also has dark shadows around his eyes.[1]\n"
	},
	{
		"Name": "Ahho Desunen IX\n",
		"link": "https://onepiece.fandom.com/wiki/Ahho_Desunen_IX",
		"Year": "2010\n",
		"Note": "His name was revealed in the Blue Deep databook.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/5/5f/Ahho_Desunen_IX_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20130114035654",
		"description": "Ahho Desunen IX[2] is a noble from the Goa Kingdom and the father of Ahho Zurako.[1]\n",
		"appareance": "Ahho Desunen is a rotund man with blond hair and a small black mustache. His nose is slightly long and pointed, and as a noble, he wears fine, white clothes with a yellow cravat.[1]\n"
	},
	{
		"Name": "Ahho Zurako\n",
		"link": "https://onepiece.fandom.com/wiki/Ahho_Zurako",
		"Year": "2010\n",
		"Note": "Her name was revealed in the Blue Deep databook.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/b/b2/Ahho_Zurako_Anime_Infobox.png/revision/latest?cb=20180417213414",
		"description": "Ahho Zurako[2] is a noble from the Goa Kingdom and the daughter of Ahho Desunen IX.[1]\n",
		"appareance": "Zurako is a girl with a rather ugly face, reddish-brown hair with a yellow bow, and a light blue dress with white bows.[1]\n"
	},
	{
		"Name": "Ahiru\n",
		"link": "https://onepiece.fandom.com/wiki/Ahiru",
		"Year": "2018\n",
		"Note": "Her name was revealed in SBS Volume 93.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/f/f1/Ahiru_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20240818020855",
		"description": "Ahiru is the deputy commander of the East Army in the Revolutionary Army and the assistant of Belo Betty.[2]\n",
		"appareance": "Ahiru is a woman with pale skin, prominent lips and long hair. Her left arm is a mechanical prosthesis. She wears a blouse with an only right long sleeve, a brown glove and a red tie; in her initial appearance, she also wore a green jacket. She has a pair of goggles on her head.[1]\n"
	},
	{
		"Name": "Aisa\n",
		"link": "https://onepiece.fandom.com/wiki/Aisa",
		"Year": "2002\n",
		"Note": "\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/1/1e/Aisa_Manga_Post_Timeskip_Infobox.png/revision/latest/scale-to-width-down/268?cb=20240820022111",
		"description": "Aisa is a young Shandia girl who used to sneak onto the Upper Yard frequently to collect Vearth.[1] She is Isa's daughter. After the timeskip, she works in the Wagomuland theme park and sells Cloud Balloons.[3]\n",
		"appareance": "Aisa is a small Shandia girl. She wears a fur dress and cap. In the manga, her dress and cap are yellow and in the lines are white. The side cloth of her cap is also green. She has short brown hair, which Raki suggests she should grow out to become more ladylike. In the anime, her dress is brown, and her cap is yellow-white, with white cloth on the sides. In the anime she runs around in bare feet, but in the manga, wears sandals and is only barefoot while receiving a haircut from Raki. She also carries a tan satchel, with yellow buckles.[1]\n"
	},
	{
		"Name": "Akehende\n",
		"link": "https://onepiece.fandom.com/wiki/Akehende",
		"Year": "2009\n",
		"Note": "His name was revealed in Vivre Card.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/e/e8/Akehende_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20190511072409",
		"description": "Akehende is a Marine Rear Admiral.[2][1]\n",
		"appareance": "Akehende as a young Marine."
	},
	{
		"Name": "Akudai Kanzaburo\n",
		"link": "https://onepiece.fandom.com/wiki/Akudai_Kanzaburo",
		"Year": "2018\n",
		"Note": "His name was revealed in Vivre Card.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/5/56/Akudai_Kanzaburo_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20210905202949",
		"description": "Akudai Kanzaburo[2] is an arms dealer who lives in the Flower Capital of Wano Country.[1]\n",
		"appareance": "Kanzaburo is man with curly dark brown hair, a semi-long beard and sideburns. His hair is styled in a pompadour at the front, while part of it is tied in a topknot at the back. He wears a light red kimono, dark green hakama with yellow swirling patterns, and a black and purple patterned cape.[1]\n"
	},
	{
		"Name": "Akumai\n",
		"link": "https://onepiece.fandom.com/wiki/Akumai",
		"Year": "2000\n",
		"Note": "His name was revealed in the Blue databook.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/4/48/Akumai_Anime_Infobox.png/revision/latest?cb=20250807233240",
		"description": "Akumai[3] was a Billions agent who followed Mr. 2 Bon Kurei everywhere[1] before he was captured by Hina when Mr. 2 and his crew sacrificed themselves to save the Straw Hat Pirates.[4]\n",
		"appareance": "His hairstyle resembles the wings of the Baroque Works symbol. He wears a grey and black striped shirt and a white scarf with black spots around the neck area. He also has a sash tied around his waist like a belt. When his leader pretended to be Cobra, he was dressed like a member of the royal guard.[5] When luring Hina form the Straw Hats, he was seen dressed as Chopper.[6]\n"
	},
	{
		"Name": "Aladine\n",
		"link": "https://onepiece.fandom.com/wiki/Aladine",
		"Year": "2011\n",
		"Note": "His name was revealed in Chapter 623.\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/0/07/Aladine_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20170528042907",
		"description": "Aladine[3] is a goatsbeard brotula merman. He was originally a Ryugu Kingdom soldier who was then enslaved, but then became a pirate as the doctor and later first mate of the Sun Pirates.[2][3] He is the husband of Charlotte Praline, serving as the bond between the Sun Pirates and the Charlotte Family.[3]\n",
		"appareance": "Aladine is a tall, muscular merman. He has slanted thin eyes, dark hair that is tied in a long ponytail falling on his back in many curves, and a full beard with a goatee in the same color. His long tail is light-brown in the upper part, but gets darker near the fins, where spots start to appear, eventually becoming a plain dark color. \n"
	},
	{
		"Name": "Albion\n",
		"link": "https://onepiece.fandom.com/wiki/Albion",
		"Year": "2010\n",
		"Note": "\n",
		"img": "https://static.wikia.nocookie.net/onepiece/images/c/c9/Albion_Anime_Infobox.png/revision/latest/scale-to-width-down/268?cb=20130207055626",
		"description": "\"Gashed\" Albion[3] is one of the rookie pirates who joined the Fake Straw Hat Crew. He has a bounty of 92,000,000.[1]\n",
		"appareance": "Albion is a pale man with a large, ovular head that is wrapped in bandages, like most of his body, from his forehead to his scalp, with his face only occupying the lowest part of his head. He has a long black ponytail on the back of his head, growing out from under the bandages, and wears a captain's coat. Around his neck is what appears to be a shirt collar with two buttons that have \"A\" on them, along with a red and maroon striped tie around his neck. He also has a dark yellow sash around his waist.\n"
	}
]
